%% readme 测试

%{ 

OrgBrand  %[] byte 未处理的所有牌的值(包括明牌) 不计花牌 可无序

%牌信息,如吃，碰，杠等
message=struct(...
    'chi',[],...   %吃得的顺子
    'peng',[],...  %碰得的刻子
    'gang',[],...  %杠 
         ...
    'HuaPai',[],...
    'Jiang' ,0, ...
	'TongTian' ,0, ... 
	'Zimo' ,0, ...
	'MenFeng' ,0, ...
	'TingBool' ,0 ...
);

%测试
main(OrgBrand,message);

42种麻将的编码如下  1-34号每种牌各4张，35-42各1张,总34*4+8=144张

1饼  1   |   1条  10     |   1万  19     |    东   28     |   春   35    |
2饼  2   |   2条  11     |   2万  20     |    西   29     |   夏   36    |          
3饼  3   |   3条  12     |   3万  21     |    南   30     |   秋   37    |          
4饼  4   |   4条  13     |   4万  22     |    北   31     |   冬   38    |          
5饼  5   |   5条  14     |   5万  23     |    中   32     |   梅   39    |          
6饼  6   |   6条  15     |   6万  24     |    发   33     |   兰   40    |          
7饼  7   |   7条  16     |   7万  25     |    白   34     |   竹   41    |          
8饼  8   |   8条  17     |   8万  26     |                |   菊   42    |
9饼  9   |   9条  18     |   9万  27     |                |              |
    
%}

%%程序未全部实现81番种的判断函数 请在自拟参数时注意。或可下面用例进行测试。


%注意，点左边框运行时，要先移动到main函数对应的文件夹 ！！！
%% 大四喜
clc;
clear;
OrgBrand=[29 29 29 29 30 30 30 30 31 31 31 31 28 28 28 28];
message=struct(...
    'chi',[],...   %吃得的顺子
    'peng',[],...  %碰得的刻子
    'gang',[29 31],...  %杠 
         ...
    'HuaPai',[40 42],...
    'Jiang' ,30, ...
	'TongTian' ,0, ... 
	'Zimo' ,1, ...
	'MenFeng' ,0, ...
	'TingBool' ,0 ...
);
%注意，点左边框运行时，要先移动到main函数对应的文件夹 
%否则会报错：未定义与 'struct' 类型的输入参数相对应的函数 'main'。
main(OrgBrand,message);

%% 三暗刻
clc;
clear;
OrgBrand=[1 1 10 10 10 20 20 20 3 3 3 11 11 11];
message=struct(...
    'chi',[],...   %吃得的顺子
    'peng',[10],...  %碰得的刻子
    'gang',[],...  %杠 
         ...
    'HuaPai',[],...
    'Jiang' ,1, ...
	'TongTian' ,0, ... 
	'Zimo' ,0, ...
	'MenFeng' ,0, ...
	'TingBool' ,0 ...
);
%注意，点左边框运行时，要先移动到main函数对应的文件夹 
%否则会报错：未定义与 'struct' 类型的输入参数相对应的函数 'main'。
main(OrgBrand,message);